# HostPerimeterComputed Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..HostPerimeterComputed Property
ParameterTypeId Class See Also
---
"Perimeter"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId HostPerimeterComputed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HostPerimeterComputed As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ HostPerimeterComputed {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace